app/Controllers/Departments.php

SELECT *
FROM `departments`
---
    public function getIndex()
    {
        $departmentsModel = model(DepartmentsModel::class);
        $data = [
            'departments' => $departmentsModel ->findAll(),
            'title' => 'Список відділів',
        ];

SELECT *
FROM `departments`
---
public function getCreate(){
    helper ('form');
    $data['title'] = 'Додати відділ';
    $departmentsModel = model(DepartmentsModel::class);
    $departments = $departmentsModel->findAll();

INSERT INTO `departments` (`department_id`, `department_name`) VALUES (NULL, 'Склад')
---
public function postCreate(){
    helper('form');
    $departmentsModel = model(DepartmentsModel::class);

    $post = $this-> request->getPost([
        "department_id ",
        "department_name",
    ]);
    $rules=[
        "department_name"=>"required",
    ];
    if(!$this->validateData($post,$rules)){
        $data["title"]="Невірні данні";
        return view('templates/header', $data)
        .view('departments/create', $data)
        .view('templates/footer');
    }
    $data["title"]="Відділ додан";
    $departmentsModel->save($post);