app/Controllers/Employees.php

    public function getIndex()
    {
        $employeeModel = new EmployeesModel();
        $positionModel = new PositionsModel();
        $ratingModel = new RatingsModel();
        $employmentStatusModel = new EmploymentStatusesModel();
        $departmentsModel = new DepartmentsModel();
        $tradeObjectsModel = new TradeObjectsModel();

        $employees = $employeeModel->getEmployees();
        $positions = $positionModel->findAll();
        $employmentStatus = $employmentStatusModel->findAll();
        $departments = $departmentsModel->findAll();
        $tradeObjects = $tradeObjectsModel->findAll();

        // РОЗРАХУНОК СЕРЕДНЬОЇ ОЦІНКИ ПРАЦІВНИКА
        $employeeRatings = [];
        foreach ($employees as $employee) {
            $employee_id = $employee['employee_id'];
            $averageRating = $ratingModel
                ->select('AVG(rating) as average_rating')
                ->where('employee_id', $employee_id)
                ->get()
                ->getRowArray();
---
SELECT *
FROM `positions`
SELECT *
FROM `employment_statuses`
SELECT *
FROM `departments`
SELECT *
FROM `trade_objects`
SELECT AVG(rating) as average_rating
FROM `ratings`
WHERE `employee_id` = '1'