app/Controllers/Ratings.php

    public function getIndex()
    {
        $ratingModel = Model(RatingsModel::class);
        $employeeModel = Model(EmployeesModel::class);

        $employees = $employeeModel->findAll();
---
SELECT *
FROM `employees`

public function getCreate(){
    helper ('form');
    $data['title'] = 'Додати оцінку працівникіа';

    $employeeModel = Model(EmployeesModel::class);
    $employees = $employeeModel->findAll();// Отримуємо всі доступні працівники
---
SELECT *
FROM `employees`

public function postCreate(){
    helper ('form');
    $employeeModel = Model(EmployeesModel::class);
    $ratingModel = Model(RatingsModel::class);

    $employees = $employeeModel->findAll();
    $data['employees'] = $employees;


    $post = $this-> request->getPost([
        "rating_id",
        "employee_id",
        "rating",
        "rating_date",
    ]);
$rules=[
    "rating"=>"required",
    "rating_date"=>"required|date",
];

if(!$this->validateData($post,$rules)){
  $data["title"]="Невірні данні";
  return view('templates/header', $data)
  .view('rating/create', $data)
  .view('templates/footer');

}

$data["title"]="Оцінка додана";
$ratingModel->save($post);
---
SELECT *
FROM `employees`
INSERT INTO `ratings` (`rating_id`, `employee_id`, `rating`, `rating_date`) VALUES (NULL, '3', '10', '2023-11-01')