app/Controllers/TradeObjects.php

SELECT *
FROM `trade_objects`
---
    public function getIndex()
    {
        $tradeObjectsModel = model(TradeObjectsModel::class);
        $data = [
            'tradeObjects' => $tradeObjectsModel ->findAll(),
            'title' => 'Список торгівельних обєктів',
        ];

SELECT *
FROM `trade_objects`
---
public function getCreate()
{
    helper('form');
    $data['title'] = 'Додати торгівельний обєкт';
    $tradeObjectsModel = model(TradeObjectsModel::class);
    $tradeObjects = $tradeObjectsModel->findAll();

INSERT INTO `trade_objects` (`object_name`, `address`) VALUES ('Пістинь', 'ВУЛ.Veleca')
---
public function postCreate()
{
    helper("form");
    $tradeObjectsModel = model(TradeObjectsModel::class);
    $post = $this->request->getPost([
        'trade_object_id',
        'object_name',
        'address',
    ]);
    $rules=[
        'object_name' => 'required',
    ];
    if(!$this->validateData($post,$rules)){
        $data["title"]="Невірні данні";
        return view('templates/header', $data)
        .view('tradeObjects/create', $data)
        .view('templates/footer');
}
$data["title"]="обєкт додан";
$tradeObjectsModel->save($post);