app/Models/EmployeesModel.php

SELECT *
FROM `employees`
---
    public function getEmployees($employee_id=false){
        if($employee_id===false){
            return $this->findAll();