app/Models/RatingsModel.php

    public function getRatings($rating_id=false){
        if($rating_id===false){
            return $this->findAll();
---
SELECT *
FROM `ratings`