app/Models/RoleModel.php

SELECT *
FROM `roles`
WHERE `roles`.`id` = '1'
---
    public function getRoles($id=false){
        if($id==false){
            return $this->findAll();
        }
        return $this->find($id);