app/Models/UserModel.php

SELECT *
FROM `users`
---
    public function getUsers($id=false){
        if($id==false){
            return $this->findAll();